WF/src/DataProcessors/ЗаполнениеПРоизводственногоКалендаря/ЗаполнениеПРоизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеПРоизводственногоКалендаря</name>
  <attributes>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДней</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рабочий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

WF/src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WF/src/DataProcessors/ЗаполнениеПРоизводственногоКалендаря/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСписокДней(Команда)
	Если Объект.ДатаНачала = '0001-01-01' ИЛИ Объект.ДатаОкончания = '0001-01-01' Тогда
		Сообщить("Интервал загрузки не указан!");
		ТекущийЭлемент = Элементы.ДатаНачала;
		Возврат
	КонецЕсли;
	Объект.СписокДней.Очистить();
	ТекущийДень = Объект.ДатаНачала;
	Пока ТекущийДень <= Объект.ДатаОкончания Цикл
		НоваяСтрока = Объект.СписокДней.Добавить();
		НоваяСтрока.Дата = ТекущийДень;
		НоваяСтрока.Рабочий = (ДеньНедели(НоваяСтрока.Дата)<6);
		НоваяСтрока.КоличествоЧасов = Объект.НормаЧасов;
		ТекущийДень = ТекущийДень + 86400; 
	КонецЦикла;
	
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеКалендаряНаСервере()
	Отбор = Новый Структура("Рабочий", Истина);
	ТаблицаГрафика = Объект.СписокДней.НайтиСтроки(Отбор);
	РегистрыСведений.ПроизводственныйКалендарь.ЗаполнитьГрафикПоТаблице(ТаблицаГрафика);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеКалендаря(Команда)
	Если Объект.СписокДней.Количество() = 0 Тогда
		Сообщить("Нет данных для импорта");
		Возврат;
	КонецЕсли;
	ЗагрузитьДанныеКалендаряНаСервере();
КонецПроцедуры
